# Напишите программу, которая по заданному номеру четверти, показывает диапазон возможных координат точек в этой четверти (x и y).

fourth = int(input("Введите номер четверти: "))

if fourth == 1: print("Диапазон возможных координат точек в этой четверти: х ∈ (0; + ∞), y ∈ (0; + ∞)")
elif fourth == 2: print("Диапазон возможных координат точек в этой четверти: х ∈ (0; - ∞), y ∈ (0; + ∞)")
elif fourth == 3: print("Диапазон возможных координат точек в этой четверти: х ∈ (0; - ∞), y ∈ (0; - ∞)")
elif fourth == 4: print("Диапазон возможных координат точек в этой четверти: х ∈ (0; + ∞), y ∈ (0; - ∞)")
else: print("Координатная плоскость ОХ и ОУ не имеет точек в заданной четверти")