# Напишите программу, которая будет преобразовывать десятичное число в двоичное.
# Пример:
# - 45 -> 101101
# - 3 -> 11
# - 2 -> 10

def binary (x):
    if x == 1:
        return '1'
    return binary(x//2) + str(x % 2) 

N = int(input("Введите число: "))
print(binary(N))