# Задайте список из нескольких чисел. Напишите программу, которая найдёт сумму элементов списка, стоящих на нечётной позиции.
# Пример:
# - [2, 3, 5, 9, 3] -> на нечётных позициях элементы 3 и 9, ответ: 12

import random

lst = []

for i in range(lengh_lst := int(input("Введите длину списка: "))):
    lst.append(random.randint(-15,15))

print("Полученный список", lst)

print("Сумма элементов списка, стоящих на нечётной позиции = ", sum(lst[::2]))
