# Напишите программу, которая принимает на вход вещественное число и показывает сумму его цифр. Пример:
# 6782 -> 23
# 0,56 -> 11

digit = input('Введите число  ')
summa = 0
for i in digit:
    if i != ',': summa += int(i)

print('Сумма цифр в числе', digit, ' = ', summa)