# Задайте последовательность чисел. Напишите программу, которая выведет список неповторяющихся элементов исходной последовательности.

import random

lst = [random.randint(0, 10) for i in range(15)]
print("Последовательность чисел ", lst)

new_lst = []
[new_lst.append(i) for i in lst if i not in new_lst]

print("Список неповторяющихся элементов в заданной последовательности ", new_lst)
