# Вычислить число c заданной точностью d
# Пример:
# - при d = 0.001, π = 3.142,    10^(-1) ≤ d ≤10^(-10)

d = float(input("Введите число с заданной точностью d (10^(-1) ≤ d ≤10^(-10)): "))
num = float(input("Введите число для округления: "))

count = 0
while d < 1:
    count += 1
    d = d * 10

print("Округленное число с точностью d = ", round(num, count))
