# Задайте натуральное число N. Напишите программу, которая составит список простых множителей числа N.

a = int(input('Введите число: '))
lst = []

for i in range(1, a + 1):
    if (a % i == 0):
        lst.append(i)

print(f'{a} = {lst}')
